#pragma once

#include "../n110_square__/n110_500_convSquare.hpp"


class SlideBits {
public:
	// 指定した位置の属する file の bit を shift し、
	// index を求める為に使用する。
	const int m_slide[SquareNum] = {
		1 , 1 , 1 , 1 , 1 , 1 , 1 , 1 , 1 ,
		10, 10, 10, 10, 10, 10, 10, 10, 10,
		19, 19, 19, 19, 19, 19, 19, 19, 19,
		28, 28, 28, 28, 28, 28, 28, 28, 28,
		37, 37, 37, 37, 37, 37, 37, 37, 37,
		46, 46, 46, 46, 46, 46, 46, 46, 46,
		55, 55, 55, 55, 55, 55, 55, 55, 55,
		1 , 1 , 1 , 1 , 1 , 1 , 1 , 1 , 1 ,
		10, 10, 10, 10, 10, 10, 10, 10, 10
	};

};


// クラス定義のあとに書くとビルドできるぜ☆（＾ｑ＾）
extern const SlideBits g_slideBits;
