#pragma once

#include "../n080_common__/n080_150_overloadEnumOperators.hpp"


// 指し手生成フェーズ☆？（＾ｑ＾）320_540_ＭｏｖｅＰｉｃｋｅｒとかで使う☆
// このフェーズは順番に実行されるぜ☆（＾ｑ＾）
enum GenerateMovePhase {
	// Nフェーズ番号(start/end)_名前

	//────────────────────────────────────────────────────────────────────────────────
	// ふつーの探索だぜ☆（＾ｑ＾）？
	//────────────────────────────────────────────────────────────────────────────────
	N00s_UNR_End____MainSearch,			// （＋＋でｔｔ）最初のフェーズ☆
	N01__N03_____Ph_TacticalMoves0,		// 駒を取る手
	N02__P2______Ph_Killers,
	N03__N04_____Ph_NonTacticalMoves0,	// 駒を取らない手
	N04__LNC_____Ph_NonTacticalMoves1,
	N05__EBC_End_Ph_BadCaptures,
	N06s_P1__End____EvasionSearch,		// （＋＋でｔｔ）初期化で使われることもあるぜ☆
	// フェーズ終わり☆

	//────────────────────────────────────────────────────────────────────────────────
	// どこからスタートだぜ☆？（＾ｑ＾）
	//────────────────────────────────────────────────────────────────────────────────
	N07__N06_____Ph_Evasions,			// 王手回避の手

	//────────────────────────────────────────────────────────────────────────────────
	// たたき合いを読む予定の深さを超えたときは、ここからかだぜ☆？（＾ｑ＾）？
	//────────────────────────────────────────────────────────────────────────────────
	// たたき合いは、読みを止めて　現局面で計算するぜ
	N08s_P1__End___QSearch,				// （＋＋でｔｔ）（Ｑ静止探索）初期化で使われることもあるぜ☆
	// フェーズ終わり☆

	//────────────────────────────────────────────────────────────────────────────────
	// どこからスタートだぜ☆？（＾ｑ＾）
	//────────────────────────────────────────────────────────────────────────────────
	N09__N03_____PhQCaptures0,			//              （Ｑ静止探索）駒を取る手

	//────────────────────────────────────────────────────────────────────────────────
	// 王手されていることが分かったときは、ここからかだぜ☆？（＾ｑ＾）？
	//────────────────────────────────────────────────────────────────────────────────
	N10s_P1__End___QEvasionSearch,		// （＋＋でｔｔ）（Ｑ静止探索）初期化で使われることもあるぜ☆
	// フェーズ終わり☆

	//────────────────────────────────────────────────────────────────────────────────
	// どこからスタートだぜ☆？（＾ｑ＾）
	//────────────────────────────────────────────────────────────────────────────────
	N11__N06_____PhQEvasions,			//             （Ｑ静止探索）王手回避の手
	N12s_P1__End____ProbCut,			// （＋＋でｔｔ）初期化で使われることもあるぜ☆
	// フェーズ終わり☆

	//────────────────────────────────────────────────────────────────────────────────
	// どこからスタートだぜ☆？（＾ｑ＾）
	//────────────────────────────────────────────────────────────────────────────────
	N13__N03_____Ph_TacticalMoves1,		// 駒を取る手

	//────────────────────────────────────────────────────────────────────────────────
	// 王手もされていないし、たたき合いを読む予定の深さも超えていない　ときは、ここからかだぜ☆？（＾ｑ＾）？
	//────────────────────────────────────────────────────────────────────────────────
	N14s_P1__UNR___QRecapture,			// （Ｑ静止探索）初期化で使われることもあるぜ☆
	// フェーズ終わり☆

	//────────────────────────────────────────────────────────────────────────────────
	// どこからスタートだぜ☆？（＾ｑ＾）
	//────────────────────────────────────────────────────────────────────────────────
	N15__REC_End_PhQCaptures1,			// （Ｑ静止探索）駒を取り返す手☆
	N16s_P1__End_Ph_Stop				//              番兵☆（＾ｑ＾）処理を止める☆
};
OverloadEnumOperators(GenerateMovePhase); // ++phase_ の為。
static const int g_MOVEGENERATOR_PHASE_NUM = 17;